#pragma once

// Mass Effect (1.2.20820.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

#include "ME1_BIOC_Base_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class BIOC_Base.Bio_Appr_Character_Base_Settings
// 0x0004 (0x004C - 0x0048)
class UBio_Appr_Character_Base_Settings : public UComponent
{
public:
	unsigned long                                      m_bIsShowingMissingResources : 1;                         // 0x0048(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.Bio_Appr_Character_Base_Settings");
		return ptr;
	}

};


// Class BIOC_Base.Bio_Appr_Character_Body_Settings
// 0x0014 (0x0060 - 0x004C)
class UBio_Appr_Character_Body_Settings : public UBio_Appr_Character_Base_Settings
{
public:
	class UBio_Appr_Character_HeadGear_Settings*       m_oHeadGearSettings;                                      // 0x004C(0x0004) (Edit, ExportObject, EditConst, Component, EditInline)
	TEnumAsByte<EBioArmorType>                         m_eArmorType;                                             // 0x0050(0x0001) (Edit)
	TEnumAsByte<EBioArmorType>                         m_eVisualOverride;                                        // 0x0051(0x0001)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0052(0x0002) MISSED OFFSET
	int                                                m_nModelVariant;                                          // 0x0054(0x0004) (Edit)
	int                                                m_nMaterialConfig;                                        // 0x0058(0x0004) (Edit)
	unsigned long                                      m_bIsHeadGearLoaded : 1;                                  // 0x005C(0x0004) (Edit)
	unsigned long                                      m_bIsHeadGearHidden : 1;                                  // 0x005C(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.Bio_Appr_Character_Body_Settings");
		return ptr;
	}

};


// Class BIOC_Base.Bio_Appr_Character_Hair_Settings
// 0x0004 (0x0050 - 0x004C)
class UBio_Appr_Character_Hair_Settings : public UBio_Appr_Character_Base_Settings
{
public:
	int                                                m_nMaterial;                                              // 0x004C(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.Bio_Appr_Character_Hair_Settings");
		return ptr;
	}

};


// Class BIOC_Base.Bio_Appr_Character_Head_Settings
// 0x000C (0x0058 - 0x004C)
class UBio_Appr_Character_Head_Settings : public UBio_Appr_Character_Base_Settings
{
public:
	int                                                m_nMaterialConfig;                                        // 0x004C(0x0004) (Edit)
	int                                                m_nHairAppearance;                                        // 0x0050(0x0004) (Edit)
	class UBio_Appr_Character_Hair_Settings*           m_oHairSettings;                                          // 0x0054(0x0004) (Edit, ExportObject, EditConst, Component, EditInline)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.Bio_Appr_Character_Head_Settings");
		return ptr;
	}

};


// Class BIOC_Base.Bio_Appr_Character_HeadGear_Settings
// 0x0025 (0x0071 - 0x004C)
class UBio_Appr_Character_HeadGear_Settings : public UBio_Appr_Character_Base_Settings
{
public:
	int                                                m_nModelSpec;                                             // 0x004C(0x0004) (Edit)
	int                                                m_nMaterialConfig;                                        // 0x0050(0x0004) (Edit)
	unsigned long                                      m_bUseBodyMaterialConfig : 1;                             // 0x0054(0x0004) (Edit)
	struct FBioHeadGearComponentSettings               m_visor;                                                  // 0x0058(0x000C) (Edit)
	struct FBioHeadGearComponentSettings               m_facePlate;                                              // 0x0064(0x000C) (Edit)
	TEnumAsByte<EBioArmorType>                         m_eVisualOverride;                                        // 0x0070(0x0001)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.Bio_Appr_Character_HeadGear_Settings");
		return ptr;
	}

};


// Class BIOC_Base.Bio_Appr_Character_Settings
// 0x0010 (0x005C - 0x004C)
class UBio_Appr_Character_Settings : public UBio_Appr_Character_Base_Settings
{
public:
	class UBio_Appr_Character_Body_Settings*           m_oBodySettings;                                          // 0x004C(0x0004) (Edit, ExportObject, EditConst, Component, EditInline)
	int                                                m_nHeadAppearance;                                        // 0x0050(0x0004) (Edit)
	unsigned long                                      m_bIsHeadHidden : 1;                                      // 0x0054(0x0004) (Edit)
	unsigned long                                      m_bIsHeadLoaded : 1;                                      // 0x0054(0x0004) (Edit)
	class UBio_Appr_Character_Head_Settings*           m_oHeadSettings;                                          // 0x0058(0x0004) (Edit, ExportObject, EditConst, Component, EditInline)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.Bio_Appr_Character_Settings");
		return ptr;
	}

};


// Class BIOC_Base.BioActorFactoryPhysicsActor
// 0x0000 (0x0095 - 0x0095)
class UBioActorFactoryPhysicsActor : public UActorFactoryRigidBody
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioActorFactoryPhysicsActor");
		return ptr;
	}

};


// Class BIOC_Base.BioAppearanceVehicleSettings
// 0x0004 (0x004C - 0x0048)
class UBioAppearanceVehicleSettings : public UComponent
{
public:
	int                                                m_nMaterialConfig;                                        // 0x0048(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioAppearanceVehicleSettings");
		return ptr;
	}

};


// Class BIOC_Base.BioCoverVolume
// 0x0000 (0x022C - 0x022C)
class ABioCoverVolume : public AVolume
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioCoverVolume");
		return ptr;
	}

};


// Class BIOC_Base.BioDamageType
// 0x000C (0x0098 - 0x008C)
class UBioDamageType : public UDamageType
{
public:
	class UBioAttributesDamage*                        m_pAttributes;                                            // 0x008C(0x0004) (Edit, ExportObject, EditConst, NeedCtorLink, EditInline)
	class UBioDeathVFX*                                m_pDeathVFX;                                              // 0x0090(0x0004) (Edit)
	unsigned long                                      m_bIsInitialized : 1;                                     // 0x0094(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioDamageType");
		return ptr;
	}


	void SetDeathVFX(class UBioDeathVFX* pDeathVFX);
	class UBioDeathVFX* GetDeathVFX();
	void SetAttributes(class UBioAttributesDamage* pAttributes);
	class UBioAttributesDamage* GetAttributes();
	void InitializeDamageType(class UBioAttributesDamage* pAttributes, class UBioDeathVFX* pDeathVFX);
};


// Class BIOC_Base.BioDEBUGMarker
// 0x0008 (0x01F8 - 0x01F0)
class ABioDEBUGMarker : public AActor
{
public:
	class UBioDEBUGMarkerComponent*                    Markers;                                                  // 0x01F0(0x0004) (Edit, ExportObject, Component, EditInline)
	float                                              TimeTillDestroy;                                          // 0x01F4(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioDEBUGMarker");
		return ptr;
	}


	void Clear();
	void AddMarker(const struct FVector& _Start, int _size, unsigned char _R, unsigned char _G, unsigned char _B);
	void AddLine(const struct FVector& _Start, const struct FVector& _End, unsigned char _R, unsigned char _G, unsigned char _B);
	void Tick(float DeltaTime);
};


// Class BIOC_Base.BioDEBUGMarkerComponent
// 0x003C (0x01F4 - 0x01B8)
class UBioDEBUGMarkerComponent : public UPrimitiveComponent
{
public:
	TArray<struct FLineData>                           Lines;                                                    // 0x01B8(0x000C) (Edit, NeedCtorLink)
	TArray<struct FLineData>                           Arrows;                                                   // 0x01C4(0x000C) (Edit, NeedCtorLink)
	TArray<struct FMarkerData>                         Markers;                                                  // 0x01D0(0x000C) (Edit, NeedCtorLink)
	TArray<struct FMarkerData>                         Diamonds;                                                 // 0x01DC(0x000C) (Edit, NeedCtorLink)
	TArray<struct FMarkerData>                         Circles;                                                  // 0x01E8(0x000C) (Edit, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioDEBUGMarkerComponent");
		return ptr;
	}


	void ClearMarkers();
	void ClearCircles();
	void ClearDiamonds();
	void ClearArrows();
	void ClearLines();
	void Clear();
	void AddCircles(const struct FVector& _Start, int _size, unsigned char _R, unsigned char _G, unsigned char _B);
	void AddDiamond(const struct FVector& _Start, int _size, unsigned char _R, unsigned char _G, unsigned char _B);
	void AddMarker(const struct FVector& _Start, int _size, unsigned char _R, unsigned char _G, unsigned char _B);
	void AddArrows(const struct FVector& _Start, const struct FVector& _End, unsigned char _R, unsigned char _G, unsigned char _B);
	void AddLine(const struct FVector& _Start, const struct FVector& _End, unsigned char _R, unsigned char _G, unsigned char _B);
};


// Class BIOC_Base.BioDestinationArrow
// 0x0004 (0x01F4 - 0x01F0)
class ABioDestinationArrow : public AActor
{
public:
	class USkeletalMeshComponent*                      Mesh;                                                     // 0x01F0(0x0004) (Edit, ExportObject, Component, EditInline)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioDestinationArrow");
		return ptr;
	}


	void SetArrowColor(TEnumAsByte<EeColorSelection> clr);
};


// Class BIOC_Base.BioEventDispatcher
// 0x0014 (0x0050 - 0x003C)
class UBioEventDispatcher : public UObject
{
public:
	struct FMap_Mirror                                 m_mEventSubscriptions;                                    // 0x003C(0x0014) (Const, Native, NoExport)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioEventDispatcher");
		return ptr;
	}


	void Dispatch(const struct FName& oEventName);
	bool Unsubscribe(const struct FName& oEventName, class UObject* oSubscriber);
	bool Subscribe(const struct FName& oEventName, class UObject* oSubscriber);
};


// Class BIOC_Base.BioFollowMarker
// 0x0000 (0x01F0 - 0x01F0)
class ABioFollowMarker : public AActor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioFollowMarker");
		return ptr;
	}

};


// Class BIOC_Base.BioGamerProfile
// 0x01FC (0x0238 - 0x003C)
class UBioGamerProfile : public UObject
{
public:
	unsigned long                                      m_bDefaultYAxisInverted : 1;                              // 0x003C(0x0004) (Transient, Config)
	unsigned long                                      m_bGamerProfileDeviceHasBeenRemoved : 1;                  // 0x003C(0x0004) (Transient)
	int                                                m_DefaultGammaPostProcessTemplate;                        // 0x0040(0x0004) (Transient, Config)
	int                                                m_nDefaultCombatDifficulty;                               // 0x0044(0x0004) (Transient, Config)
	int                                                m_nDefaultDialogMode;                                     // 0x0048(0x0004) (Transient, Config)
	int                                                m_nDefaultAutoLevelUp;                                    // 0x004C(0x0004) (Transient, Config)
	int                                                m_nDefaultAutoEquip;                                      // 0x0050(0x0004) (Transient, Config)
	int                                                m_nDefaultTutorialFlag;                                   // 0x0054(0x0004) (Transient, Config)
	int                                                m_nDefaultSubTitles;                                      // 0x0058(0x0004) (Transient, Config)
	int                                                m_nDefaultAutoPauseEnemySighted;                          // 0x005C(0x0004) (Transient, Config)
	int                                                m_nDefaultAutoPauseSquadMemberDown;                       // 0x0060(0x0004) (Transient, Config)
	int                                                m_nDefaultMusicVolume;                                    // 0x0064(0x0004) (Transient, Config)
	int                                                m_nDefaultFXVolume;                                       // 0x0068(0x0004) (Transient, Config)
	int                                                m_nDefaultDialogVolume;                                   // 0x006C(0x0004) (Transient, Config)
	int                                                m_nDefaultSouthpawFlag;                                   // 0x0070(0x0004) (Transient, Config)
	int                                                m_nDefaultTargetingAssistMode;                            // 0x0074(0x0004) (Transient, Config)
	float                                              m_nDefaultTargetingAssistModifierHigh;                    // 0x0078(0x0004) (Transient, Config)
	float                                              m_nDefaultTargetingAssistModifierNormal;                  // 0x007C(0x0004) (Transient, Config)
	float                                              m_nDefaultTargetingAssistModifierLow;                     // 0x0080(0x0004) (Transient, Config)
	int                                                m_nDefaultHorizontalCombatSensitivity;                    // 0x0084(0x0004) (Transient, Config)
	int                                                m_nDefaultVerticalCombatSensitivity;                      // 0x0088(0x0004) (Transient, Config)
	int                                                m_nDefaultHorizontalExplorationSensitivity;               // 0x008C(0x0004) (Transient, Config)
	int                                                m_nDefaultVerticalExplorationSensitivity;                 // 0x0090(0x0004) (Transient, Config)
	int                                                m_nDefaultControllerSensativityLow;                       // 0x0094(0x0004) (Transient, Config)
	int                                                m_nDefaultControllerSensativityMedium;                    // 0x0098(0x0004) (Transient, Config)
	int                                                m_nDefaultControllerSensativityHigh;                      // 0x009C(0x0004) (Transient, Config)
	struct FName                                       m_nmSKU;                                                  // 0x00A0(0x0008) (Transient, Config)
	int                                                m_nDefaultRumbleFlag;                                     // 0x00A8(0x0004) (Transient, Config)
	int                                                m_nDefaultAutoPauseBleedOut;                              // 0x00AC(0x0004) (Transient, Config)
	int                                                m_nDefaultMotionBlur;                                     // 0x00B0(0x0004) (Transient, Config)
	int                                                m_nDefaultFilmGrain;                                      // 0x00B4(0x0004) (Transient, Config)
	int                                                m_nDefaultSquadPowerUse;                                  // 0x00B8(0x0004) (Transient, Config)
	int                                                m_nDefaultAutoSave;                                       // 0x00BC(0x0004) (Transient, Config)
	int                                                m_nAchievedCombatDifficultyOverride;                      // 0x00C0(0x0004) (Transient, Config)
	int                                                m_nDefaultAnalogSensePerc;                                // 0x00C4(0x0004) (Transient, Config)
	int                                                m_nDefaultMouseSensePerc;                                 // 0x00C8(0x0004) (Transient, Config)
	int                                                m_nDefaultInvertMouseState;                               // 0x00CC(0x0004) (Transient, Config)
	TArray<struct FProfileBOOL>                        BoolVariables;                                            // 0x00D0(0x000C) (NeedCtorLink)
	TArray<struct FProfileINT>                         IntVariables;                                             // 0x00DC(0x000C) (NeedCtorLink)
	TArray<struct FProfileFLOAT>                       FloatVariables;                                           // 0x00E8(0x000C) (NeedCtorLink)
	TArray<struct FPlotManagerAchievement>             PlotManagerAchievementMaps;                               // 0x00F4(0x000C) (NeedCtorLink)
	int                                                m_nLastUsedPlaythroughID;                                 // 0x0100(0x0004)
	TArray<struct FProfilePlaythrough>                 lstPlaythroughs;                                          // 0x0104(0x000C) (NeedCtorLink)
	float                                              m_fLowestPlaythroughDamageTaken;                          // 0x0110(0x0004)
	int                                                m_nMostMoneyAccumulated;                                  // 0x0114(0x0004)
	int                                                m_nMostPlaythroughPlayerKills;                            // 0x0118(0x0004)
	int                                                m_nLowestPlaythroughPlayerDeaths;                         // 0x011C(0x0004)
	float                                              m_fFastestPlaythroughTime;                                // 0x0120(0x0004)
	int                                                m_DefaultSaveDeviceId;                                    // 0x0124(0x0004)
	int                                                m_BioProfileSaveDeviceId;                                 // 0x0128(0x0004)
	unsigned long                                      m_bInvalidProfileCreator : 1;                             // 0x012C(0x0004)
	TArray<unsigned long>                              aAchievementStates;                                       // 0x0130(0x000C) (NeedCtorLink, Deprecated)
	TArray<struct FProfileRewardStat>                  RewardStats;                                              // 0x013C(0x000C) (NeedCtorLink)
	TArray<int>                                        anAchievementStates;                                      // 0x0148(0x000C) (NeedCtorLink)
	TArray<struct FBonusTalent>                        aUnlockedBonusTalents;                                    // 0x0154(0x000C) (NeedCtorLink)
	TArray<struct FBonusTalent>                        aPassiveBonusTalents;                                     // 0x0160(0x000C) (NeedCtorLink)
	TArray<int>                                        IntStats;                                                 // 0x016C(0x000C) (NeedCtorLink)
	TArray<float>                                      FloatStats;                                               // 0x0178(0x000C) (NeedCtorLink)
	TArray<struct FCharacterProfile>                   lstCharacterProfiles;                                     // 0x0184(0x000C) (NeedCtorLink)
	struct FGameOptions                                m_GameOptions;                                            // 0x0190(0x0090)
	struct FString                                     m_sLastPlayedCharacterID;                                 // 0x0220(0x000C) (NeedCtorLink)
	struct FString                                     m_sLastSaveGame;                                          // 0x022C(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioGamerProfile");
		return ptr;
	}


	void SetCoolDown(bool bEnabled);
	bool GetCoolDown();
	void UpdateRichPresence();
	void UpdateSoundOptions();
	void UpdateGraphicsOptions();
	void UpdateAllOptions(bool bUpdateRichPresence);
	void DuplicateGameOptions(struct FGameOptions* destOptions);
	void OverwiteGameOptions(const struct FGameOptions& sourceOptions, bool bUpdateRichPresence);
	float GetTargetingAssistModifier();
	void GetOptionEx(const struct FGameOptions& io_oGameOptions, int i_nOptionType, int* i_nOptionValue);
	void GetOption(int i_nOptionType, int* i_nOptionValue);
	void SetOptionEx(int i_nOptionType, int i_nOptionValue, bool i_bSuppressUpdate, struct FGameOptions* io_oGameOptions);
	void SetOption(int i_nOptionType, int i_nOptionValue, bool i_bSuppressUpdate);
	int GetCombatDifficulty();
	void SetCombatDifficulty(int i_Template);
	void DumpAchievementStats();
	int GetGammaPostProcessTemplate();
	void SetGammaPostProcessTemplate(int i_Template);
	void SelectDefaultStorageDevice();
	int GetDefaultStorageDevice();
	void SetDefaultStorageDevice(int i_DeviceId);
	int GetBioProfileStorageDevice();
	void SetBioProfileStorageDevice(int i_DeviceId);
	void SetYAxisInverted(bool bInverted);
	bool GetYAxisInverted();
	void GetAllUnlockedBonusTalentInfo(const struct FName& nmCharClass, TArray<struct FUnlockedBonusTalentInfo>* aUnlockedBonusTalentInfo);
	void AwardAllPassiveBonusTalents();
	void UpdateAchievementState(int nAchievementID, bool bEarned, bool bUpdatePlotState, bool bAwardBonusTalent);
	void GetDefaultValues(struct FGameOptions* io_Options);
	void ResetToDefaults(bool bUpdateRichPresence);
	void SortAchievementInfo(TArray<struct FAchievementInfo>* aAchievementList);
	void GetAllAchievementInfo(TArray<struct FAchievementInfo>* aAchievementList);
	bool GetIsAchievementEarned(int AchievementId);
	bool UpdateCharacterProfilePawnDataEx(class ABioPawn* i_playerPawn, bool i_bUpdateFirstName, int i_oHoursPlayed, int i_oMinPlayed, int i_oSecPlayed, struct FCharacterProfile* sCharProfile);
	bool UpdateCharacterProfilePawnData(const struct FString& sCharacterID, class ABioPawn* i_playerPawn, int i_oHoursPlayed, int i_oMinPlayed, int i_oSecPlayed, bool i_bUpdateFirstName);
	bool DeleteCharacterProfile(const struct FString& sCharacterID);
	int GetCharacterProfileIndex(const struct FString& sCharacterID);
	void SetCharacterProfile(const struct FString& sCharacterID, const struct FCharacterProfile& i_CharProfile, bool i_bAddProfileIfNotExist);
	struct FCharacterProfile GetCharacterProfile(const struct FString& sCharacterID);
	bool SetCharacterProfileLastPlayedSlot(const struct FString& sCharacaterID, int nLastPlayedSlot);
	struct FString ConvertToValidCharacterID(const struct FString& sCharacterName, bool bConvertAccentCharacters);
	struct FString CreateNewCharacterProfile(const struct FString& sCharacterName);
	bool SetFloatStatistic(int nIndex, float fValue);
	float InrementFloatStatistic(int nIndex, float fAmount);
	float GetFloatStatistic(int nIndex);
	bool SetIntStatistic(int nIndex, int nValue);
	int IncrementIntStatistic(int nIndex, int nAmount);
	int GetIntStatistic(int nIndex);
	int GetHighestDifficultyCompleted();
	bool GetPlaythroughCompleted(int nDifficulty);
	int GetNumberOfPlaythroughsCompleted();
	bool UpdateEndGameGamerProfileStats(bool bLogStats);
	void GetUnlockedTalentTrees(TArray<int>* aUnlockedTalentTrees);
	int GetRewardStatUnlockedAt(const struct FString& sStatisticName);
	struct FString GetRewardStatName(int nAchievementID);
	bool GetIsRewardStatUnlocked(const struct FString& sStatisticName);
	int IncrementRewardStat(const struct FString& sStatisticName, int nAmount);
	bool SetRewardStat(const struct FString& sStatisticName, int nValue);
	bool RestoreGamerProfilePlotManagerVariables();
	bool SetGamerProfilePlotManagerVariables();
};


// Class BIOC_Base.BioLayers
// 0x0028 (0x006C - 0x0044)
class UBioLayers : public UBioBaseComponent
{
public:
	float                                              m_aEntry[0xA];                                            // 0x0044(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioLayers");
		return ptr;
	}

};


// Class BIOC_Base.BioObject
// 0x0014 (0x0058 - 0x0044)
class UBioObject : public UBioBaseComponent
{
public:
	unsigned char                                      UnknownData00[0x14];                                      // 0x0044(0x0014) UNKNOWN PROPERTY: MapProperty BIOC_Base.BioObject.m_ClassCache

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioObject");
		return ptr;
	}


	bool STATIC_ValidateOwnershipSemantics(class UObject* Target, bool isVerbose, int recurrence);
	void STATIC_ParseIntoArray(const struct FString& sDelimitedStrings, const struct FString& sDelimiter, bool bCullEmptyStrings, TArray<struct FString>* aString);
	void STATIC_ParseIntoArrayWS(const struct FString& whitespaceDelimitedStrings, TArray<struct FString>* Strings);
	bool STATIC_GetEnumValue(class UClass* clsEnumDefiner, const struct FName& nmEnumField, const struct FName& nmEnumValue, unsigned char* cEnumValue);
	class UClass* STATIC_FindClass(const struct FName& nmClass);
};


// Class BIOC_Base.BioPathNodeVolume
// 0x001E (0x024A - 0x022C)
class ABioPathNodeVolume : public AVolume
{
public:
	unsigned long                                      bDeleteNodesOnPopulate : 1;                               // 0x022C(0x0004) (Edit)
	unsigned long                                      bDoNotGenerateGroundNodes : 1;                            // 0x022C(0x0004) (Edit)
	float                                              fMaxNodeSeparation;                                       // 0x0230(0x0004) (Edit)
	float                                              fMargin;                                                  // 0x0234(0x0004) (Edit)
	float                                              fNodeTargetRadius;                                        // 0x0238(0x0004) (Edit)
	float                                              fMaxSlope;                                                // 0x023C(0x0004) (Edit)
	int                                                nLevels;                                                  // 0x0240(0x0004) (Edit)
	float                                              fLevelHeight;                                             // 0x0244(0x0004) (Edit)
	TEnumAsByte<EBioPathNodeAlignment>                 eAlignment;                                               // 0x0248(0x0001) (Edit)
	TEnumAsByte<EBioPathNodeGenerators>                ePathNodeGenerator;                                       // 0x0249(0x0001) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioPathNodeVolume");
		return ptr;
	}

};


// Class BIOC_Base.BioPhysicsSounds
// 0x002C (0x0068 - 0x003C)
class UBioPhysicsSounds : public UObject
{
public:
	struct FString                                     m_sPhysicsSoundEntity;                                    // 0x003C(0x000C) (Config, NeedCtorLink)
	float                                              m_fMaxMass;                                               // 0x0048(0x0004) (Config)
	float                                              m_fMaxSpeed;                                              // 0x004C(0x0004) (Config)
	unsigned long                                      m_bPhysicsSoundDebug : 1;                                 // 0x0050(0x0004) (Config)
	float                                              m_fMinTimeBetweenSoundByActor;                            // 0x0054(0x0004) (Config)
	int                                                m_nMaxSimultaneousSounds;                                 // 0x0058(0x0004) (Config)
	TArray<struct FBioPhysicsSoundsInfo>               m_aAudioTracks;                                           // 0x005C(0x000C) (Transient, Component, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioPhysicsSounds");
		return ptr;
	}


	bool RequestSound(int nPriority, class UPrimitiveComponent* oComp0, class UPrimitiveComponent* oComp1, struct FCollisionImpactData* RigidCollisionData);
	void Initialize();
};


// Class BIOC_Base.BioPowerScript
// 0x0020 (0x005C - 0x003C)
class UBioPowerScript : public UObject
{
public:
	class UBioPower*                                   m_oPower;                                                 // 0x003C(0x0004)
	float                                              m_fPowerBuildUp;                                          // 0x0040(0x0004)
	struct FVector                                     m_vWorldImpactLocation;                                   // 0x0044(0x000C)
	struct FVector                                     m_vWorldImpactNormal;                                     // 0x0050(0x000C)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioPowerScript");
		return ptr;
	}


	bool PlayForceFeedback(class AActor* oCaster, class AActor* oImpacted);
	bool PlayGuiSound(const struct FName& nmSound);
	bool GetFloorLocation(const struct FVector& vStartLocation, struct FVector* vFloorLocation);
	bool AdjustCooldown(float* fCoolDownTime);
	bool OnImpact(class AActor* oCaster, float fCasterStability, class AActor* oImpacted, int nPreviouslyImpacted);
	bool EndPhase(TEnumAsByte<EBioPowerState> ePhase, class AActor* oCaster);
	bool StartPhase(TEnumAsByte<EBioPowerState> ePhase, class AActor* oCaster, float fDuration);
	bool CanStartPower(class AActor* oCaster);
	void InitializePowerScript(class UBioPower* pPower);
};


// Class BIOC_Base.BioProceduralCameraBasic
// 0x0000 (0x003C - 0x003C)
class UBioProceduralCameraBasic : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioProceduralCameraBasic");
		return ptr;
	}


	void STATIC_FixedCamera(const struct FActorInfo& stActorInfo, bool bInvert, struct FCameraInfo* stCameraInfo);
};


// Class BIOC_Base.BioRadarMapBoundaries
// 0x000C (0x01FC - 0x01F0)
class ABioRadarMapBoundaries : public AActor
{
public:
	struct FVector                                     m_vBoundarySize;                                          // 0x01F0(0x000C) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioRadarMapBoundaries");
		return ptr;
	}

};


// Class BIOC_Base.BioSocketSupermodel
// 0x000C (0x0244 - 0x0238)
class UBioSocketSupermodel : public USkeletalMesh
{
public:
	TArray<class USkeletalMesh*>                       Dependents;                                               // 0x0238(0x000C) (Edit, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioSocketSupermodel");
		return ptr;
	}

};


// Class BIOC_Base.BioSpriteTranslucentComponent
// 0x0024 (0x01E8 - 0x01C4)
class UBioSpriteTranslucentComponent : public USpriteComponent
{
public:
	float                                              TranslucentScale;                                         // 0x01C4(0x0004) (Edit)
	float                                              fDelayTime;                                               // 0x01C8(0x0004) (Edit)
	float                                              fFadeInTime;                                              // 0x01CC(0x0004) (Edit)
	float                                              fDuration;                                                // 0x01D0(0x0004) (Edit)
	float                                              fFadeOutTime;                                             // 0x01D4(0x0004) (Edit)
	unsigned long                                      bRenderOcclusionOnly : 1;                                 // 0x01D8(0x0004) (Edit)
	unsigned long                                      bIsOccluder : 1;                                          // 0x01D8(0x0004)
	float                                              fIntensityCurveAccumulator;                               // 0x01DC(0x0004) (Transient)
	float                                              fScaleCurveAccumulator;                                   // 0x01E0(0x0004) (Transient)
	float                                              fBrightnessCurveAccumulator;                              // 0x01E4(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioSpriteTranslucentComponent");
		return ptr;
	}

};


// Class BIOC_Base.BioSunActor
// 0x00CC (0x02BC - 0x01F0)
class ABioSunActor : public AActor
{
public:
	float                                              FocusDistance;                                            // 0x01F0(0x0004) (Edit)
	struct FLinearColor                                SunTint;                                                  // 0x01F4(0x0010) (Edit)
	unsigned long                                      UseBaseLightTint : 1;                                     // 0x0204(0x0004) (Edit)
	unsigned long                                      HideAllFlaresOverride : 1;                                // 0x0204(0x0004) (Edit)
	unsigned long                                      ViewDependentIntensity : 1;                               // 0x0204(0x0004) (Edit)
	unsigned long                                      bAnimateIntensity : 1;                                    // 0x0204(0x0004) (Edit)
	unsigned long                                      bAnimateScale : 1;                                        // 0x0204(0x0004) (Edit)
	unsigned long                                      bAnimateBrightness : 1;                                   // 0x0204(0x0004) (Edit)
	class UBioSpriteTranslucentComponent*              SunSprite;                                                // 0x0208(0x0004) (Edit, ExportObject, Component, EditInline)
	class UBioSunFlareComponent*                       HaloSprite;                                               // 0x020C(0x0004) (Edit, ExportObject, Component, EditInline)
	class UBioSunFlareComponent*                       FlareSprite0;                                             // 0x0210(0x0004) (Edit, ExportObject, Component, EditInline)
	class UBioSunFlareComponent*                       FlareSprite1;                                             // 0x0214(0x0004) (Edit, ExportObject, Component, EditInline)
	class UBioSunFlareComponent*                       FlareSprite2;                                             // 0x0218(0x0004) (Edit, ExportObject, Component, EditInline)
	class UBioSunFlareComponent*                       FlareSprite3;                                             // 0x021C(0x0004) (Edit, ExportObject, Component, EditInline)
	class UBioSunFlareComponent*                       FlareSprite4;                                             // 0x0220(0x0004) (Edit, ExportObject, Component, EditInline)
	class UBioSunFlareComponent*                       FlareSprite5;                                             // 0x0224(0x0004) (Edit, ExportObject, Component, EditInline)
	class UBioSunFlareComponent*                       FlareSprite6;                                             // 0x0228(0x0004) (Edit, ExportObject, Component, EditInline)
	class UBioSunFlareComponent*                       FlareSprite7;                                             // 0x022C(0x0004) (Edit, ExportObject, Component, EditInline)
	class UBioSunFlareComponent*                       FlareSprite8;                                             // 0x0230(0x0004) (Edit, ExportObject, Component, EditInline)
	class UBioSunFlareComponent*                       FlareSprite9;                                             // 0x0234(0x0004) (Edit, ExportObject, Component, EditInline)
	class UBioSunFlareStreakComponent*                 StreakSprite0;                                            // 0x0238(0x0004) (Edit, ExportObject, Component, EditInline)
	class UBioSunFlareStreakComponent*                 StreakSprite1;                                            // 0x023C(0x0004) (Edit, ExportObject, Component, EditInline)
	class UBioSunFlareStreakComponent*                 StreakSprite2;                                            // 0x0240(0x0004) (Edit, ExportObject, Component, EditInline)
	class UBioSunFlareStreakComponent*                 StreakSprite3;                                            // 0x0244(0x0004) (Edit, ExportObject, Component, EditInline)
	class UBioSunFlareStreakComponent*                 StreakSprite4;                                            // 0x0248(0x0004) (Edit, ExportObject, Component, EditInline)
	class UBioSunFlareStreakComponent*                 StreakSprite5;                                            // 0x024C(0x0004) (Edit, ExportObject, Component, EditInline)
	struct FRawDistributionFloat                       IntensityCurve;                                           // 0x0250(0x001C) (Edit, ExportObject, EditConst, Component, NeedCtorLink, EditInline)
	float                                              fIntensityCurveAccumulator;                               // 0x026C(0x0004) (Transient)
	struct FRawDistributionFloat                       ScaleCurve;                                               // 0x0270(0x001C) (Edit, ExportObject, EditConst, Component, NeedCtorLink, EditInline)
	float                                              fScaleCurveAccumulator;                                   // 0x028C(0x0004) (Transient)
	struct FRawDistributionFloat                       BrightnessCurve;                                          // 0x0290(0x001C) (Edit, ExportObject, EditConst, Component, NeedCtorLink, EditInline)
	float                                              fBrightnessCurveAccumulator;                              // 0x02AC(0x0004) (Transient)
	float                                              fDyingFadePercent;                                        // 0x02B0(0x0004) (Transient)
	unsigned long                                      bDying : 1;                                               // 0x02B4(0x0004) (Transient)
	float                                              fFadeTime;                                                // 0x02B8(0x0004) (Config)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioSunActor");
		return ptr;
	}

};


// Class BIOC_Base.BioSunFlareComponent
// 0x0020 (0x0208 - 0x01E8)
class UBioSunFlareComponent : public UBioSpriteTranslucentComponent
{
public:
	float                                              Intensity;                                                // 0x01E8(0x0004) (Edit)
	struct FLinearColor                                FlareTint;                                                // 0x01EC(0x0010) (Edit)
	unsigned long                                      UseParentOverrideTint : 1;                                // 0x01FC(0x0004) (Edit)
	unsigned long                                      IsHaloComponent : 1;                                      // 0x01FC(0x0004)
	float                                              Distance;                                                 // 0x0200(0x0004) (Edit)
	float                                              BrightPercent;                                            // 0x0204(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioSunFlareComponent");
		return ptr;
	}

};


// Class BIOC_Base.BioSunFlareStreakComponent
// 0x0030 (0x0218 - 0x01E8)
class UBioSunFlareStreakComponent : public UBioSpriteTranslucentComponent
{
public:
	float                                              Intensity;                                                // 0x01E8(0x0004) (Edit)
	struct FLinearColor                                FlareTint;                                                // 0x01EC(0x0010) (Edit)
	unsigned long                                      UseParentOverrideTint : 1;                                // 0x01FC(0x0004) (Edit)
	unsigned long                                      IsHaloComponent : 1;                                      // 0x01FC(0x0004)
	float                                              Distance;                                                 // 0x0200(0x0004) (Edit)
	float                                              HorizontalOffset;                                         // 0x0204(0x0004) (Edit)
	float                                              HorizontalMoveRate;                                       // 0x0208(0x0004) (Edit)
	float                                              VerticalOffset;                                           // 0x020C(0x0004) (Edit)
	float                                              VerticalMoveRate;                                         // 0x0210(0x0004) (Edit)
	float                                              BrightPercent;                                            // 0x0214(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioSunFlareStreakComponent");
		return ptr;
	}

};


// Class BIOC_Base.BioTacticalMoveToIndicator
// 0x000C (0x01FC - 0x01F0)
class ABioTacticalMoveToIndicator : public AActor
{
public:
	class UParticleSystemComponent*                    ParticleSystem;                                           // 0x01F0(0x0004) (ExportObject, Component, EditInline)
	float                                              m_fFadeInTime;                                            // 0x01F4(0x0004)
	float                                              m_fTimePassed;                                            // 0x01F8(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioTacticalMoveToIndicator");
		return ptr;
	}

};


// Class BIOC_Base.BioTestString
// 0x0010 (0x0200 - 0x01F0)
class ABioTestString : public AActor
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x01F0(0x0004) UNKNOWN PROPERTY: StringRefProperty BIOC_Base.BioTestString.LocalizedString
	struct FString                                     NonLocalizedString;                                       // 0x01F4(0x000C) (Edit, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioTestString");
		return ptr;
	}

};


// Class BIOC_Base.BioTriggerStream
// 0x0018 (0x0244 - 0x022C)
class ABioTriggerStream : public ATriggerVolume
{
public:
	int                                                m_StoredStateIndex;                                       // 0x022C(0x0004)
	int                                                m_nPriorityLevel;                                         // 0x0230(0x0004) (Edit)
	TArray<struct FBioStreamingState>                  StreamingStates;                                          // 0x0234(0x000C) (Edit, NeedCtorLink)
	class UBioSWF*                                     m_oAreaMapOverride;                                       // 0x0240(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioTriggerStream");
		return ptr;
	}


	void UnTouch(class AActor* Other);
	void Touch(class AActor* Other, class UPrimitiveComponent* OtherComp, const struct FVector& HitLocation, const struct FVector& HitNormal);
	void Retouch();
	void DoStasis(class AActor* Touched, bool bTouched);
	void DoUntouch(class AActor* Other);
	void DoTouch();
};


// Class BIOC_Base.BioAnimNodeBlendBase
// 0x001C (0x00E0 - 0x00C4)
class UBioAnimNodeBlendBase : public UAnimNodeBlendBase
{
public:
	float                                              m_fBlendTime;                                             // 0x00C4(0x0004)
	unsigned long                                      m_bIsBlending : 1;                                        // 0x00C8(0x0004)
	unsigned long                                      m_bTriggerTimeBlend : 1;                                  // 0x00C8(0x0004)
	unsigned long                                      m_bBlendDirect : 1;                                       // 0x00C8(0x0004)
	unsigned long                                      m_bShowSlider : 1;                                        // 0x00C8(0x0004)
	float                                              m_fRemainingTime;                                         // 0x00CC(0x0004)
	float                                              m_fTotalBlendTime;                                        // 0x00D0(0x0004)
	float                                              m_fTargetWeight;                                          // 0x00D4(0x0004)
	int                                                m_nLastChild;                                             // 0x00D8(0x0004)
	int                                                m_nTargetChild;                                           // 0x00DC(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioAnimNodeBlendBase");
		return ptr;
	}


	void SetChildAnimTime(class UAnimNode* oChild, float fTime);
};


// Class BIOC_Base.BioAnimNodeBlendAdditive
// 0x0004 (0x00E4 - 0x00E0)
class UBioAnimNodeBlendAdditive : public UBioAnimNodeBlendBase
{
public:
	float                                              m_fPreviewWeight;                                         // 0x00E0(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioAnimNodeBlendAdditive");
		return ptr;
	}

};


// Class BIOC_Base.BioAnimNodeBlendAdditiveAim
// 0x000C (0x00F0 - 0x00E4)
class UBioAnimNodeBlendAdditiveAim : public UBioAnimNodeBlendAdditive
{
public:
	float                                              BlendInDuration;                                          // 0x00E4(0x0004) (Edit)
	float                                              BlendOutDuration;                                         // 0x00E8(0x0004) (Edit)
	unsigned long                                      bIsCoverAiming : 1;                                       // 0x00EC(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioAnimNodeBlendAdditiveAim");
		return ptr;
	}

};


// Class BIOC_Base.BioAnimNodeBlendAdditiveCover
// 0x0008 (0x00EC - 0x00E4)
class UBioAnimNodeBlendAdditiveCover : public UBioAnimNodeBlendAdditive
{
public:
	float                                              BlendInDuration;                                          // 0x00E4(0x0004) (Edit)
	float                                              BlendOutDuration;                                         // 0x00E8(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioAnimNodeBlendAdditiveCover");
		return ptr;
	}

};


// Class BIOC_Base.BioAnimNodeBlendAdditiveDamage
// 0x001C (0x0100 - 0x00E4)
class UBioAnimNodeBlendAdditiveDamage : public UBioAnimNodeBlendAdditive
{
public:
	int                                                DamageNodeIndex;                                          // 0x00E4(0x0004) (Edit)
	unsigned long                                      bLastDamageNode : 1;                                      // 0x00E8(0x0004) (Edit)
	unsigned long                                      bProcessDamage : 1;                                       // 0x00E8(0x0004)
	float                                              MaxDamageThreshold;                                       // 0x00EC(0x0004) (Edit)
	struct FVector                                     m_vDamageDir;                                             // 0x00F0(0x000C)
	int                                                m_nDamageIndex;                                           // 0x00FC(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioAnimNodeBlendAdditiveDamage");
		return ptr;
	}

};


// Class BIOC_Base.BioAnimNodeBlendAdditivePower
// 0x0009 (0x00ED - 0x00E4)
class UBioAnimNodeBlendAdditivePower : public UBioAnimNodeBlendAdditive
{
public:
	float                                              BlendInDuration;                                          // 0x00E4(0x0004) (Edit)
	float                                              BlendOutDuration;                                         // 0x00E8(0x0004) (Edit)
	TEnumAsByte<EBioPowerAdditiveAnimNode>             m_eCurrentAnimNode;                                       // 0x00EC(0x0001) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioAnimNodeBlendAdditivePower");
		return ptr;
	}


	bool GetActivePower(class UBioActivePower** oActivePower);
};


// Class BIOC_Base.BioAnimNodeBlendAdditiveWeaponEquip
// 0x0020 (0x0104 - 0x00E4)
class UBioAnimNodeBlendAdditiveWeaponEquip : public UBioAnimNodeBlendAdditive
{
public:
	float                                              BlendInDuration;                                          // 0x00E4(0x0004) (Edit)
	float                                              BlendOutDuration;                                         // 0x00E8(0x0004) (Edit)
	struct FString                                     m_sStartEventName;                                        // 0x00EC(0x000C) (Transient, NeedCtorLink)
	struct FString                                     m_sEndEventName;                                          // 0x00F8(0x000C) (Transient, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioAnimNodeBlendAdditiveWeaponEquip");
		return ptr;
	}

};


// Class BIOC_Base.BioAnimNodeBlendByAction
// 0x03D0 (0x04AC - 0x00DC)
class UBioAnimNodeBlendByAction : public UAnimNodeBlendList
{
public:
	TEnumAsByte<EBioActionAnimNode>                    m_eCurrentAnimNode;                                       // 0x00DC(0x0001) (Transient)
	unsigned char                                      UnknownData00[0x3];                                       // 0x00DD(0x0003) MISSED OFFSET
	unsigned long                                      m_bHesitateAvailable : 1;                                 // 0x00E0(0x0004) (Transient)
	unsigned long                                      m_bFallingAvailable : 1;                                  // 0x00E0(0x0004) (Transient)
	struct FBlendTime                                  m_aBlendTimeFromPostureNode[0xB];                         // 0x00E4(0x0008) (Edit)
	struct FBlendTime                                  m_aBlendTimeFromMountNode[0xB];                           // 0x013C(0x0008) (Edit)
	struct FBlendTime                                  m_aBlendTimeFromHesitateNode[0xB];                        // 0x0194(0x0008) (Edit)
	struct FBlendTime                                  m_aBlendTimeFromFallNode[0xB];                            // 0x01EC(0x0008) (Edit)
	struct FBlendTime                                  m_aBlendTimeFromBioticNode[0xB];                          // 0x0244(0x0008) (Edit)
	struct FBlendTime                                  m_aBlendTimeFromDeathNode[0xB];                           // 0x029C(0x0008) (Edit)
	struct FBlendTime                                  m_aBlendTimeFromDieNode[0xB];                             // 0x02F4(0x0008) (Edit)
	struct FBlendTime                                  m_aBlendTimeFromTechNode[0xB];                            // 0x034C(0x0008) (Edit)
	struct FBlendTime                                  m_aBlendTimeFromMatineeNode[0xB];                         // 0x03A4(0x0008) (Edit)
	struct FBlendTime                                  m_aBlendTimeFromGetUpNode[0xB];                           // 0x03FC(0x0008) (Edit)
	struct FBlendTime                                  m_aBlendTimeFromGestures[0xB];                            // 0x0454(0x0008) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioAnimNodeBlendByAction");
		return ptr;
	}

};


// Class BIOC_Base.BioAnimNodeBlendByAim
// 0x0048 (0x0128 - 0x00E0)
class UBioAnimNodeBlendByAim : public UBioAnimNodeBlendBase
{
public:
	float                                              PitchLimitDegrees;                                        // 0x00E0(0x0004) (Edit)
	float                                              YawTwistLimitDegrees;                                     // 0x00E4(0x0004) (Edit)
	float                                              YawTurnTriggerDegrees;                                    // 0x00E8(0x0004) (Edit)
	float                                              HoldTime;                                                 // 0x00EC(0x0004) (Edit)
	TEnumAsByte<EeAimSliderAxis>                       PreviewSliderAxis;                                        // 0x00F0(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x00F1(0x0003) MISSED OFFSET
	float                                              m_AimBlendOutDuration;                                    // 0x00F4(0x0004) (Edit, Const)
	float                                              m_AimBlendInDuration;                                     // 0x00F8(0x0004) (Edit, Const)
	float                                              m_fYawRate;                                               // 0x00FC(0x0004) (Edit)
	float                                              m_fPitchRate;                                             // 0x0100(0x0004)
	struct FVector                                     m_vFixedRotation;                                         // 0x0104(0x000C)
	float                                              m_fTimeToUpdate;                                          // 0x0110(0x0004)
	float                                              m_fYaw;                                                   // 0x0114(0x0004)
	float                                              m_fPitch;                                                 // 0x0118(0x0004)
	float                                              m_fTargetYaw;                                             // 0x011C(0x0004)
	unsigned long                                      m_BlendedOut : 1;                                         // 0x0120(0x0004)
	float                                              m_RemainingBlendDuration;                                 // 0x0124(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioAnimNodeBlendByAim");
		return ptr;
	}

};


// Class BIOC_Base.BioAnimNodeBlendByAnimationStateTracking
// 0x0024 (0x0100 - 0x00DC)
class UBioAnimNodeBlendByAnimationStateTracking : public UAnimNodeBlendList
{
public:
	TArray<struct FBioAnimationNode>                   m_aStateList;                                             // 0x00DC(0x000C) (Edit, EditConst, NeedCtorLink, EditInline)
	struct FName                                       m_nmStateToTrack;                                         // 0x00E8(0x0008) (Edit)
	unsigned long                                      m_bAutoTransitionOnEndAnim : 1;                           // 0x00F0(0x0004) (Edit)
	struct FName                                       m_nmLastState;                                            // 0x00F4(0x0008)
	int                                                m_nCurrentChild;                                          // 0x00FC(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioAnimNodeBlendByAnimationStateTracking");
		return ptr;
	}

};


// Class BIOC_Base.BioAnimNodeBlendByCustomAnim
// 0x0000 (0x00D0 - 0x00D0)
class UBioAnimNodeBlendByCustomAnim : public UAnimNodeBlend
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioAnimNodeBlendByCustomAnim");
		return ptr;
	}

};


// Class BIOC_Base.BioAnimNodeBlendByDamage
// 0x0008 (0x00E8 - 0x00E0)
class UBioAnimNodeBlendByDamage : public UBioAnimNodeBlendBase
{
public:
	unsigned long                                      bAdditiveMode : 1;                                        // 0x00E0(0x0004) (Edit)
	int                                                m_nLastDamageIndex;                                       // 0x00E4(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioAnimNodeBlendByDamage");
		return ptr;
	}

};


// Class BIOC_Base.BioAnimNodeBlendByDeath
// 0x0050 (0x0130 - 0x00E0)
class UBioAnimNodeBlendByDeath : public UBioAnimNodeBlendBase
{
public:
	struct FName                                       Head;                                                     // 0x00E0(0x0008) (Edit)
	struct FName                                       LeftArm;                                                  // 0x00E8(0x0008) (Edit)
	struct FName                                       RightArm;                                                 // 0x00F0(0x0008) (Edit)
	struct FName                                       LeftLeg;                                                  // 0x00F8(0x0008) (Edit)
	struct FName                                       RightLeg;                                                 // 0x0100(0x0008) (Edit)
	struct FName                                       DeathEventName;                                           // 0x0108(0x0008) (Edit)
	int                                                m_nHeadRoot;                                              // 0x0110(0x0004) (Const)
	int                                                m_nLeftArmRoot;                                           // 0x0114(0x0004) (Const)
	int                                                m_nRightArmRoot;                                          // 0x0118(0x0004) (Const)
	int                                                m_nLeftLegRoot;                                           // 0x011C(0x0004) (Const)
	int                                                m_nRightLegRoot;                                          // 0x0120(0x0004) (Const)
	unsigned long                                      m_bEventTriggered : 1;                                    // 0x0124(0x0004)
	float                                              m_fTimeToRagdoll;                                         // 0x0128(0x0004)
	float                                              m_fCurrentTime;                                           // 0x012C(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioAnimNodeBlendByDeath");
		return ptr;
	}

};


// Class BIOC_Base.BioAnimNodeBlendByFireSequence
// 0x000C (0x00D0 - 0x00C4)
class UBioAnimNodeBlendByFireSequence : public UAnimNodeBlendBase
{
public:
	TEnumAsByte<EBioAnimNodeBlendByFireSequenceState>  m_state;                                                  // 0x00C4(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x00C5(0x0003) MISSED OFFSET
	float                                              m_blendTime;                                              // 0x00C8(0x0004)
	float                                              m_blendDuration;                                          // 0x00CC(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BIOC_Base.BioAnimNodeBlendByFireSequence");
		return ptr;
	}

};


// Class BIOC_Base.BioAnimNodeBlendByIncline
// 0x0014 (0x00F4 - 0x00E0)
