#pragma once

// Mass Effect (1.2.20820.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

#include "ME1_Engine_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class Engine.BioGlobalObjectContainer
// 0x0018 (0x0054 - 0x003C)
class UBioGlobalObjectContainer : public UObject
{
public:
	struct FName                                       PackageName;                                              // 0x003C(0x0008)
	class UPackage*                                    LoadedPackage;                                            // 0x0044(0x0004)
	TArray<class UObject*>                             LoadedObjects;                                            // 0x0048(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.BioGlobalObjectContainer");
		return ptr;
	}

};


// Class Engine.Engine
// 0x03E4 (0x0424 - 0x0040)
class UEngine : public USubsystem
{
public:
	class UFont*                                       TinyFont;                                                 // 0x0040(0x0004)
	struct FString                                     TinyFontName;                                             // 0x0044(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UFont*                                       SmallFont;                                                // 0x0050(0x0004)
	struct FString                                     SmallFontName;                                            // 0x0054(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UFont*                                       MediumFont;                                               // 0x0060(0x0004)
	struct FString                                     MediumFontName;                                           // 0x0064(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UFont*                                       LargeFont;                                                // 0x0070(0x0004)
	struct FString                                     LargeFontName;                                            // 0x0074(0x000C) (Config, GlobalConfig, NeedCtorLink)
	TArray<class UFont*>                               AdditionalFonts;                                          // 0x0080(0x000C) (NeedCtorLink)
	TArray<struct FString>                             AdditionalFontNames;                                      // 0x008C(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UClass*                                      ConsoleClass;                                             // 0x0098(0x0004)
	struct FString                                     ConsoleClassName;                                         // 0x009C(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UClass*                                      GameViewportClientClass;                                  // 0x00A8(0x0004)
	struct FString                                     GameViewportClientClassName;                              // 0x00AC(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UClass*                                      DataStoreClientClass;                                     // 0x00B8(0x0004)
	struct FString                                     DataStoreClientClassName;                                 // 0x00BC(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UClass*                                      LocalPlayerClass;                                         // 0x00C8(0x0004)
	struct FString                                     LocalPlayerClassName;                                     // 0x00CC(0x000C) (Config, NeedCtorLink)
	class UMaterial*                                   DefaultMaterial;                                          // 0x00D8(0x0004)
	struct FString                                     DefaultMaterialName;                                      // 0x00DC(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UMaterial*                                   WireframeMaterial;                                        // 0x00E8(0x0004)
	struct FString                                     WireframeMaterialName;                                    // 0x00EC(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UMaterial*                                   EmissiveTexturedMaterial;                                 // 0x00F8(0x0004)
	struct FString                                     EmissiveTexturedMaterialName;                             // 0x00FC(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UMaterial*                                   GeomMaterial;                                             // 0x0108(0x0004)
	struct FString                                     GeomMaterialName;                                         // 0x010C(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UMaterial*                                   DefaultFogVolumeMaterial;                                 // 0x0118(0x0004)
	struct FString                                     DefaultFogVolumeMaterialName;                             // 0x011C(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UMaterial*                                   TickMaterial;                                             // 0x0128(0x0004)
	struct FString                                     TickMaterialName;                                         // 0x012C(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UMaterial*                                   CrossMaterial;                                            // 0x0138(0x0004)
	struct FString                                     CrossMaterialName;                                        // 0x013C(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UMaterial*                                   VisColorationMaterialInChunk;                             // 0x0148(0x0004)
	struct FString                                     VisColorationMaterialInChunkName;                         // 0x014C(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UMaterial*                                   VisColorationMaterialLoadChunk;                           // 0x0158(0x0004)
	struct FString                                     VisColorationMaterialLoadChunkName;                       // 0x015C(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UMaterial*                                   VisColorationMaterialVisibleChunk;                        // 0x0168(0x0004)
	struct FString                                     VisColorationMaterialVisibleChunkName;                    // 0x016C(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UMaterial*                                   VisColorationMaterialMasterMap;                           // 0x0178(0x0004)
	struct FString                                     VisColorationMaterialMasterMapName;                       // 0x017C(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UMaterial*                                   VisColorationMaterialUnloaded;                            // 0x0188(0x0004)
	struct FString                                     VisColorationMaterialUnloadedName;                        // 0x018C(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UMaterial*                                   BioColorChunkMaterial;                                    // 0x0198(0x0004)
	struct FString                                     BioColorChunkMaterialName;                                // 0x019C(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UMaterial*                                   BioTranslucentVolumeMaterial;                             // 0x01A8(0x0004)
	struct FString                                     BioTranslucentVolumeMaterialName;                         // 0x01AC(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UMaterial*                                   LevelColorationLitMaterial;                               // 0x01B8(0x0004)
	struct FString                                     LevelColorationLitMaterialName;                           // 0x01BC(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UMaterial*                                   LevelColorationUnlitMaterial;                             // 0x01C8(0x0004)
	struct FString                                     LevelColorationUnlitMaterialName;                         // 0x01CC(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UMaterial*                                   RemoveSurfaceMaterial;                                    // 0x01D8(0x0004)
	struct FString                                     RemoveSurfaceMaterialName;                                // 0x01DC(0x000C) (Config, GlobalConfig, NeedCtorLink)
	TArray<struct FColor>                              LightComplexityColors;                                    // 0x01E8(0x000C) (Config, GlobalConfig, NeedCtorLink)
	TArray<struct FColor>                              ShaderComplexityColors;                                   // 0x01F4(0x000C) (Config, GlobalConfig, NeedCtorLink)
	unsigned long                                      bUsePixelShaderComplexity : 1;                            // 0x0200(0x0004) (Config, GlobalConfig)
	unsigned long                                      bUseAdditiveComplexity : 1;                               // 0x0200(0x0004) (Config, GlobalConfig)
	unsigned long                                      bUseSound : 1;                                            // 0x0200(0x0004) (Edit, Config)
	unsigned long                                      bUseMusicSound : 1;                                       // 0x0200(0x0004) (Edit, Config)
	unsigned long                                      bUseTextureStreaming : 1;                                 // 0x0200(0x0004) (Edit, Config)
	unsigned long                                      bUseBackgroundLevelStreaming : 1;                         // 0x0200(0x0004) (Edit, Config)
	unsigned long                                      bSubtitlesEnabled : 1;                                    // 0x0200(0x0004) (Edit, Config)
	unsigned long                                      bSubtitlesForcedOff : 1;                                  // 0x0200(0x0004) (Edit, Config)
	unsigned long                                      bForceStaticTerrain : 1;                                  // 0x0200(0x0004) (Edit, Config)
	unsigned long                                      DisplayLazyLoadErrors : 1;                                // 0x0200(0x0004) (Config)
	unsigned long                                      m_bSaveInitialized : 1;                                   // 0x0200(0x0004)
	unsigned long                                      bForceCPUSkinning : 1;                                    // 0x0200(0x0004) (Config)
	unsigned long                                      bUsePostProcessEffects : 1;                               // 0x0200(0x0004) (Config)
	unsigned long                                      bOnScreenKismetWarnings : 1;                              // 0x0200(0x0004) (Config)
	unsigned long                                      bEnableKismetLogging : 1;                                 // 0x0200(0x0004) (Config)
	unsigned long                                      bAllowMatureLanguage : 1;                                 // 0x0200(0x0004) (Config)
	unsigned long                                      bEnableVSMShadows : 1;                                    // 0x0200(0x0004) (Config)
	unsigned long                                      bEnableBranchingPCFShadows : 1;                           // 0x0200(0x0004) (Config)
	unsigned long                                      bRenderTerrainCollisionAsOverlay : 1;                     // 0x0200(0x0004) (Config)
	unsigned long                                      bDisablePhysXHardwareSupport : 1;                         // 0x0200(0x0004) (Config)
	float                                              MaxPixelShaderAdditiveComplexityCount;                    // 0x0204(0x0004) (Config, GlobalConfig)
	float                                              MaxPixelShaderOpaqueComplexityCount;                      // 0x0208(0x0004) (Config, GlobalConfig)
	float                                              MaxVertexShaderComplexityCount;                           // 0x020C(0x0004) (Config, GlobalConfig)
	float                                              MinTextureDensity;                                        // 0x0210(0x0004) (Config, GlobalConfig)
	float                                              IdealTextureDensity;                                      // 0x0214(0x0004) (Config, GlobalConfig)
	float                                              MaxTextureDensity;                                        // 0x0218(0x0004) (Config, GlobalConfig)
	class UMaterial*                                   EditorBrushMaterial;                                      // 0x021C(0x0004)
	struct FString                                     EditorBrushMaterialName;                                  // 0x0220(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UPhysicalMaterial*                           DefaultPhysMaterial;                                      // 0x022C(0x0004)
	struct FString                                     DefaultPhysMaterialName;                                  // 0x0230(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UMaterial*                                   TerrainErrorMaterial;                                     // 0x023C(0x0004)
	struct FString                                     TerrainErrorMaterialName;                                 // 0x0240(0x000C) (Config, GlobalConfig, NeedCtorLink)
	int                                                TerrainMaterialMaxTextureCount;                           // 0x024C(0x0004) (Config, GlobalConfig)
	class UClass*                                      OnlineSubsystemClass;                                     // 0x0250(0x0004)
	struct FString                                     DefaultOnlineSubsystemName;                               // 0x0254(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UPostProcessChain*                           DefaultPostProcess;                                       // 0x0260(0x0004)
	struct FString                                     DefaultPostProcessName;                                   // 0x0264(0x000C) (Config, NeedCtorLink)
	class UPostProcessChain*                           ThumbnailSkeletalMeshPostProcess;                         // 0x0270(0x0004)
	struct FString                                     ThumbnailSkeletalMeshPostProcessName;                     // 0x0274(0x000C) (Config, NeedCtorLink)
	class UPostProcessChain*                           ThumbnailParticleSystemPostProcess;                       // 0x0280(0x0004)
	struct FString                                     ThumbnailParticleSystemPostProcessName;                   // 0x0284(0x000C) (Config, NeedCtorLink)
	class UPostProcessChain*                           ThumbnailMaterialPostProcess;                             // 0x0290(0x0004)
	struct FString                                     ThumbnailMaterialPostProcessName;                         // 0x0294(0x000C) (Config, NeedCtorLink)
	class UPostProcessChain*                           DefaultUIScenePostProcess;                                // 0x02A0(0x0004)
	struct FString                                     DefaultUIScenePostProcessName;                            // 0x02A4(0x000C) (Config, NeedCtorLink)
	class UMaterial*                                   DefaultUICaretMaterial;                                   // 0x02B0(0x0004)
	struct FString                                     DefaultUICaretMaterialName;                               // 0x02B4(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UMaterial*                                   SceneCaptureReflectActorMaterial;                         // 0x02C0(0x0004)
	struct FString                                     SceneCaptureReflectActorMaterialName;                     // 0x02C4(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UMaterial*                                   SceneCaptureCubeActorMaterial;                            // 0x02D0(0x0004)
	struct FString                                     SceneCaptureCubeActorMaterialName;                        // 0x02D4(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UTexture2D*                                  RandomAngleTexture;                                       // 0x02E0(0x0004)
	struct FString                                     RandomAngleTextureName;                                   // 0x02E4(0x000C) (Config, GlobalConfig, NeedCtorLink)
	float                                              TimeBetweenPurgingPendingKillObjects;                     // 0x02F0(0x0004) (Edit, Config)
	class UClient*                                     Client;                                                   // 0x02F4(0x0004) (Const)
	TArray<class ULocalPlayer*>                        GamePlayers;                                              // 0x02F8(0x000C) (AlwaysInit, NeedCtorLink)
	class UGameViewportClient*                         GameViewport;                                             // 0x0304(0x0004) (Const)
	TArray<struct FString>                             DeferredCommands;                                         // 0x0308(0x000C) (AlwaysInit, NeedCtorLink)
	TArray<struct FString>                             NextFrameDeferredCommands;                                // 0x0314(0x000C) (AlwaysInit, NeedCtorLink)
	int                                                TickCycles;                                               // 0x0320(0x0004)
	int                                                GameCycles;                                               // 0x0324(0x0004)
	int                                                ClientCycles;                                             // 0x0328(0x0004)
	class UDebugManager*                               DebugManager;                                             // 0x032C(0x0004) (Const)
	struct FPointer                                    RemoteControlExec;                                        // 0x0330(0x0004) (Native)
	struct FColor                                      C_WorldBox;                                               // 0x0334(0x0004) (Edit)
	struct FColor                                      C_BrushWire;                                              // 0x0338(0x0004) (Edit)
	struct FColor                                      C_AddWire;                                                // 0x033C(0x0004) (Edit)
	struct FColor                                      C_SubtractWire;                                           // 0x0340(0x0004) (Edit)
	struct FColor                                      C_SemiSolidWire;                                          // 0x0344(0x0004) (Edit)
	struct FColor                                      C_NonSolidWire;                                           // 0x0348(0x0004) (Edit)
	struct FColor                                      C_WireBackground;                                         // 0x034C(0x0004) (Edit)
	struct FColor                                      C_ScaleBoxHi;                                             // 0x0350(0x0004) (Edit)
	struct FColor                                      C_VolumeCollision;                                        // 0x0354(0x0004) (Edit)
	struct FColor                                      C_BSPCollision;                                           // 0x0358(0x0004) (Edit)
	struct FColor                                      C_OrthoBackground;                                        // 0x035C(0x0004) (Edit)
	struct FColor                                      C_Volume;                                                 // 0x0360(0x0004) (Edit)
	float                                              StreamingDistanceFactor;                                  // 0x0364(0x0004) (Edit)
	struct FString                                     ScoutClassName;                                           // 0x0368(0x000C) (Const, Config, NeedCtorLink)
	TArray<struct FBioLayerDetails>                    m_BioLayerDetails;                                        // 0x0374(0x000C) (Config, NeedCtorLink)
	TArray<struct FString>                             m_SupportedLocLanguages;                                  // 0x0380(0x000C) (Config, NeedCtorLink)
	TEnumAsByte<ETransitionType>                       TransitionType;                                           // 0x038C(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x038D(0x0003) MISSED OFFSET
	struct FString                                     TransitionDescription;                                    // 0x0390(0x000C) (NeedCtorLink)
	float                                              MeshLODRange;                                             // 0x039C(0x0004) (Config)
	float                                              ShadowFilterRadius;                                       // 0x03A0(0x0004) (Config)
	float                                              DepthBias;                                                // 0x03A4(0x0004) (Config)
	int                                                MinShadowResolution;                                      // 0x03A8(0x0004) (Config)
	int                                                MaxShadowResolution;                                      // 0x03AC(0x0004) (Config)
	float                                              ModShadowFadeDistanceExponent;                            // 0x03B0(0x0004) (Config)
	float                                              CameraRotationThreshold;                                  // 0x03B4(0x0004) (Config)
	float                                              CameraTranslationThreshold;                               // 0x03B8(0x0004) (Config)
	float                                              CameraFOVThreshold;                                       // 0x03BC(0x0004) (Config)
	float                                              PrimitiveProbablyVisibleTime;                             // 0x03C0(0x0004) (Config)
	float                                              PercentUnoccludedRequeries;                               // 0x03C4(0x0004) (Config)
	float                                              ShadowVolumeLightRadiusThreshold;                         // 0x03C8(0x0004) (Config)
	float                                              ShadowVolumePrimitiveScreenSpacePercentageThreshold;      // 0x03CC(0x0004) (Config)
	class UMaterial*                                   TerrainCollisionMaterial;                                 // 0x03D0(0x0004)
	struct FString                                     TerrainCollisionMaterialName;                             // 0x03D4(0x000C) (Config, GlobalConfig, NeedCtorLink)
	int                                                BeginUPTryCount;                                          // 0x03E0(0x0004) (Config)
	TArray<struct FDropNoteInfo>                       PendingDroppedNotes;                                      // 0x03E4(0x000C) (Transient, NeedCtorLink)
	struct FString                                     DynamicCoverMeshComponentName;                            // 0x03F0(0x000C) (Config, GlobalConfig, NeedCtorLink)
	TArray<class UMaterial*>                           EffectsMaterials;                                         // 0x03FC(0x000C) (NeedCtorLink)
	int                                                EffectsMaterialsVersionNumber;                            // 0x0408(0x0004)
	struct FPointer                                    m_pP4Connection;                                          // 0x040C(0x0004) (Const)
	float                                              fUpdateMessageBoxTimer;                                   // 0x0410(0x0004) (Transient)
	unsigned long                                      bIsSaveGamerProfileComplete : 1;                          // 0x0414(0x0004) (Transient)
	int                                                nGamerProfileSaveSize;                                    // 0x0418(0x0004) (Config)
	float                                              m_fEngineState;                                           // 0x041C(0x0004) (Transient)
	int                                                GesturePriorityToUpdate;                                  // 0x0420(0x0004) (Config)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.Engine");
		return ptr;
	}


	class UFont* STATIC_GetAdditionalFont(int AdditionalFontIndex);
	class UFont* STATIC_GetLargeFont();
	class UFont* STATIC_GetMediumFont();
	class UFont* STATIC_GetSmallFont();
	class UFont* STATIC_GetTinyFont();
	class AWorldInfo* STATIC_GetCurrentWorldInfo();
	void GamerProfileSavingMessageBoxCheck(float fDeltaT, class UObject* oMsgBox);
	void ReLaunchExecutable();
	void InitializeGamerProfileFromCancel(bool bAPressed, int i_dwDeviceSelectionId);
	void CancelDeviceSelection(int i_dwDeviceSelectionId);
	void InitializeGamerProfileEx(class UBioSFPanel* i_oPanel);
	void InitializeGamerProfile(int i_dwDeviceSelectionId);
};


// Class Engine.GameEngine
// 0x0130 (0x0554 - 0x0424)
class UGameEngine : public UEngine
{
public:
	unsigned long                                      m_bPlayLogoMovie : 1;                                     // 0x0424(0x0004) (Config)
	unsigned long                                      m_bIsLogoMovieInterruptable : 1;                          // 0x0424(0x0004) (Config)
	unsigned long                                      bShouldCommitPendingMapChange : 1;                        // 0x0424(0x0004) (Const)
	unsigned long                                      bShouldSkipLevelStartupEventOnMapCommit : 1;              // 0x0424(0x0004) (Const)
	unsigned long                                      bShouldSkipLevelBeginningEventOnMapCommit : 1;            // 0x0424(0x0004) (Const)
	unsigned long                                      bSmoothFrameRate : 1;                                     // 0x0424(0x0004) (Config)
	unsigned long                                      m_bPlayedLogoMovie : 1;                                   // 0x0424(0x0004) (Transient)
	class UPendingLevel*                               GPendingLevel;                                            // 0x0428(0x0004)
	struct FURL                                        LastURL;                                                  // 0x042C(0x0044) (NeedCtorLink)
	struct FURL                                        LastRemoteURL;                                            // 0x0470(0x0044) (NeedCtorLink)
	TArray<struct FString>                             ServerActors;                                             // 0x04B4(0x000C) (Config, NeedCtorLink)
	struct FString                                     TravelURL;                                                // 0x04C0(0x000C) (NeedCtorLink)
	unsigned char                                      TravelType;                                               // 0x04CC(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x04CD(0x0003) MISSED OFFSET
	class UOnlineSubsystem*                            OnlineSubsystem;                                          // 0x04D0(0x0004)
	TArray<struct FName>                               LevelsToLoadForPendingMapChange;                          // 0x04D4(0x000C) (Const, NeedCtorLink)
	TArray<class ULevel*>                              LoadedLevelsForPendingMapChange;                          // 0x04E0(0x000C) (Const, NeedCtorLink)
	struct FString                                     PendingMapChangeFailureDescription;                       // 0x04EC(0x000C) (Const, NeedCtorLink)
	float                                              MaxSmoothedFrameRate;                                     // 0x04F8(0x0004) (Config)
	float                                              MinSmoothedFrameRate;                                     // 0x04FC(0x0004) (Config)
	TArray<struct FLevelStreamingStatus>               PendingLevelStreamingStatusUpdates;                       // 0x0500(0x000C) (Const, NeedCtorLink)
	TArray<class UObjectReferencer*>                   ObjectReferencers;                                        // 0x050C(0x000C) (Const, NeedCtorLink)
	TArray<struct FFullyLoadedPackagesInfo>            PackagesToFullyLoad;                                      // 0x0518(0x000C) (NeedCtorLink)
	TArray<struct FName>                               DefaultPackagesToLoadPerMap;                              // 0x0524(0x000C) (Transient, Config, NeedCtorLink)
	TArray<struct FPerMapExclusionPackagesInfo>        PackagesToExcludePerMap;                                  // 0x0530(0x000C) (Transient, Config, NeedCtorLink)
	TArray<class UBioGlobalObjectContainer*>           GlobalPackagesLoaded;                                     // 0x053C(0x000C) (Transient, NeedCtorLink)
	struct FString                                     mViewportModificationCommand;                             // 0x0548(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.GameEngine");
		return ptr;
	}


	class UOnlineSubsystem* STATIC_GetOnlineSubsystem();
};


// Class Engine.Actor
// 0x01B4 (0x01F0 - 0x003C)
class AActor : public UObject
{
public:
	TArray<class UActorComponent*>                     Components;                                               // 0x003C(0x000C) (Const, ExportObject, Component, NeedCtorLink, EditInline)
	class UBioBaseComponent*                           oBioComponent;                                            // 0x0048(0x0004) (Edit, Const, ExportObject, NeedCtorLink, EditInline)
	TArray<class UActorComponent*>                     AllComponents;                                            // 0x004C(0x000C) (Const, ExportObject, Transient, Component, NeedCtorLink, EditInline)
	struct AActor_FRenderCommandFence                  DetachFence;                                              // 0x0058(0x0008) (Const, Native)
	float                                              CustomTimeDilation;                                       // 0x0060(0x0004)
	float                                              fRangeTo;                                                 // 0x0064(0x0004) (Transient)
	TArray<class UTexture2D*>                          PrimedTextures;                                           // 0x0068(0x000C) (Transient, NeedCtorLink)
	TEnumAsByte<EPhysics>                              Physics;                                                  // 0x0074(0x0001) (Edit, Const, Net)
	TEnumAsByte<ENetRole>                              RemoteRole;                                               // 0x0075(0x0001) (Net)
	TEnumAsByte<ENetRole>                              Role;                                                     // 0x0076(0x0001) (Net)
	unsigned char                                      RenderGroupHint;                                          // 0x0077(0x0001) (Edit)
	TEnumAsByte<ETickingGroup>                         TickGroup;                                                // 0x0078(0x0001) (Const)
	TEnumAsByte<EBioRadarType>                         m_eRadarType;                                             // 0x0079(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x2];                                       // 0x007A(0x0002) MISSED OFFSET
	class AActor*                                      Owner;                                                    // 0x007C(0x0004) (Const, Net)
	class AActor*                                      Base;                                                     // 0x0080(0x0004) (Edit, Const, Net)
	TArray<struct FTimerData>                          Timers;                                                   // 0x0084(0x000C) (Const, NeedCtorLink)
	unsigned long                                      bStatic : 1;                                              // 0x0090(0x0004) (Const)
	unsigned long                                      bHidden : 1;                                              // 0x0090(0x0004) (Edit, Const, Net)
	unsigned long                                      bNoDelete : 1;                                            // 0x0090(0x0004) (Const)
	unsigned long                                      bDeleteMe : 1;                                            // 0x0090(0x0004) (Const)
	unsigned long                                      bOnlyOwnerSee : 1;                                        // 0x0090(0x0004) (Const)
	unsigned long                                      bStasis : 1;                                              // 0x0090(0x0004)
	unsigned long                                      bWorldGeometry : 1;                                       // 0x0090(0x0004)
	unsigned long                                      bIgnoreRigidBodyPawns : 1;                                // 0x0090(0x0004)
	unsigned long                                      bOrientOnSlope : 1;                                       // 0x0090(0x0004)
	unsigned long                                      bIgnoreEncroachers : 1;                                   // 0x0090(0x0004) (Const)
	unsigned long                                      bPushedByEncroachers : 1;                                 // 0x0090(0x0004)
	unsigned long                                      bRouteBeginPlayEvenIfStatic : 1;                          // 0x0090(0x0004) (Const)
	unsigned long                                      bIsMoving : 1;                                            // 0x0090(0x0004) (Const)
	unsigned long                                      bAlwaysEncroachCheck : 1;                                 // 0x0090(0x0004)
	unsigned long                                      bNetTemporary : 1;                                        // 0x0090(0x0004) (Const)
	unsigned long                                      bOnlyRelevantToOwner : 1;                                 // 0x0090(0x0004) (Const)
	unsigned long                                      bAlwaysRelevant : 1;                                      // 0x0090(0x0004)
	unsigned long                                      bReplicateInstigator : 1;                                 // 0x0090(0x0004)
	unsigned long                                      bReplicateMovement : 1;                                   // 0x0090(0x0004)
	unsigned long                                      bSkipActorPropertyReplication : 1;                        // 0x0090(0x0004)
	unsigned long                                      bUpdateSimulatedPosition : 1;                             // 0x0090(0x0004)
	unsigned long                                      bTearOff : 1;                                             // 0x0090(0x0004) (Net)
	unsigned long                                      bOnlyDirtyReplication : 1;                                // 0x0090(0x0004)
	unsigned long                                      bDemoRecording : 1;                                       // 0x0090(0x0004)
	unsigned long                                      bDemoOwner : 1;                                           // 0x0090(0x0004)
	unsigned long                                      bNetInitialRotation : 1;                                  // 0x0090(0x0004) (Const)
	unsigned long                                      bReplicatePredictedVelocity : 1;                          // 0x0090(0x0004)
	unsigned long                                      bReplicateRigidBodyLocation : 1;                          // 0x0090(0x0004)
	unsigned long                                      bKillDuringLevelTransition : 1;                           // 0x0090(0x0004)
	unsigned long                                      bExchangedRoles : 1;                                      // 0x0090(0x0004) (Const)
	unsigned long                                      bConsiderAllStaticMeshComponentsForStreaming : 1;         // 0x0090(0x0004) (Edit)
	unsigned long                                      bDebug : 1;                                               // 0x0090(0x0004) (Edit)
	unsigned long                                      bPostRenderIfNotVisible : 1;                              // 0x0094(0x0004)
	unsigned long                                      bHardAttach : 1;                                          // 0x0094(0x0004) (Edit, Const, Net)
	unsigned long                                      bIgnoreBaseRotation : 1;                                  // 0x0094(0x0004) (Edit)
	unsigned long                                      bShadowParented : 1;                                      // 0x0094(0x0004) (Edit)
	unsigned long                                      bCanBeAdheredTo : 1;                                      // 0x0094(0x0004)
	unsigned long                                      bCanBeFrictionedTo : 1;                                   // 0x0094(0x0004)
	unsigned long                                      bBioSnapToBase : 1;                                       // 0x0094(0x0004) (Edit)
	unsigned long                                      m_bBioBoneDependsOnBaseSkel : 1;                          // 0x0094(0x0004)
	unsigned long                                      UseCharacterLights : 1;                                   // 0x0094(0x0004) (Const, Deprecated)
	unsigned long                                      bHurtEntry : 1;                                           // 0x0094(0x0004)
	unsigned long                                      bGameRelevant : 1;                                        // 0x0094(0x0004)
	unsigned long                                      bMovable : 1;                                             // 0x0094(0x0004) (Const)
	unsigned long                                      bDestroyInPainVolume : 1;                                 // 0x0094(0x0004)
	unsigned long                                      bCanBeDamaged : 1;                                        // 0x0094(0x0004)
	unsigned long                                      bShouldBaseAtStartup : 1;                                 // 0x0094(0x0004)
	unsigned long                                      bPendingDelete : 1;                                       // 0x0094(0x0004)
	unsigned long                                      bCanTeleport : 1;                                         // 0x0094(0x0004)
	unsigned long                                      bAlwaysTick : 1;                                          // 0x0094(0x0004) (Const)
	unsigned long                                      bBlocksNavigation : 1;                                    // 0x0094(0x0004) (Edit)
	unsigned long                                      bCollideWhenPlacing : 1;                                  // 0x0094(0x0004)
	unsigned long                                      bCollideActors : 1;                                       // 0x0094(0x0004) (Const, Net)
	unsigned long                                      bCollideWorld : 1;                                        // 0x0094(0x0004) (Net)
	unsigned long                                      bCollideComplex : 1;                                      // 0x0094(0x0004) (Edit)
	unsigned long                                      bBlockActors : 1;                                         // 0x0094(0x0004) (Net)
	unsigned long                                      bProjTarget : 1;                                          // 0x0094(0x0004) (Net)
	unsigned long                                      bBlocksTeleport : 1;                                      // 0x0094(0x0004)
	unsigned long                                      bNoEncroachCheck : 1;                                     // 0x0094(0x0004) (Edit)
	unsigned long                                      bBounce : 1;                                              // 0x0094(0x0004)
	unsigned long                                      bJustTeleported : 1;                                      // 0x0094(0x0004) (Const)
	unsigned long                                      bNetInitial : 1;                                          // 0x0094(0x0004) (Const)
	unsigned long                                      bNetOwner : 1;                                            // 0x0094(0x0004) (Const, Net)
	unsigned long                                      bHiddenEd : 1;                                            // 0x0094(0x0004) (Edit, Const)
	unsigned long                                      bHiddenEdGroup : 1;                                       // 0x0098(0x0004) (Edit, Const)
	unsigned long                                      bHiddenEdCustom : 1;                                      // 0x0098(0x0004) (Const)
	unsigned long                                      bEdShouldSnap : 1;                                        // 0x0098(0x0004) (Edit)
	unsigned long                                      bPathColliding : 1;                                       // 0x0098(0x0004) (Edit)
	unsigned long                                      bScriptInitialized : 1;                                   // 0x0098(0x0004)
	unsigned long                                      bTransientsInitialized : 1;                               // 0x0098(0x0004)
	unsigned long                                      bLockLocation : 1;                                        // 0x0098(0x0004) (Edit)
	unsigned long                                      bTickDuringPlayersOnly : 1;                               // 0x0098(0x0004)
	unsigned long                                      bNoTick : 1;                                              // 0x0098(0x0004) (Edit)
	unsigned long                                      m_bCombatStasis : 1;                                      // 0x0098(0x0004)
	unsigned long                                      m_bRadarDisabled : 1;                                     // 0x0098(0x0004) (Edit)
	unsigned long                                      m_bWasInVehicleTransition : 1;                            // 0x0098(0x0004) (Edit)
	unsigned long                                      bTicked : 1;                                              // 0x0098(0x0004) (Const, Transient)
	unsigned long                                      bNetDirty : 1;                                            // 0x0098(0x0004) (Transient)
	unsigned long                                      m_bFirstTick : 1;                                         // 0x0098(0x0004) (Transient)
	unsigned long                                      BlockRigidBody : 1;                                       // 0x0098(0x0004) (Edit, Const, Transient)
	unsigned long                                      m_bIsChangingCollision : 1;                               // 0x0098(0x0004) (Transient)
	unsigned long                                      bTempEditor : 1;                                          // 0x0098(0x0004) (Const, Transient)
	unsigned long                                      bPathTemp : 1;                                            // 0x0098(0x0004) (Transient)
	int                                                m_nTickPriority;                                          // 0x009C(0x0004) (Transient)
	struct FDouble                                     m_fLastUpdateTime;                                        // 0x00A0(0x0008) (Transient)
	int                                                NetTag;                                                   // 0x00A8(0x0004) (Const, Transient)
	float                                              NetUpdateTime;                                            // 0x00AC(0x0004)
	float                                              NetUpdateFrequency;                                       // 0x00B0(0x0004)
	float                                              NetPriority;                                              // 0x00B4(0x0004)
	class APawn*                                       Instigator;                                               // 0x00B8(0x0004) (Net)
	class AWorldInfo*                                  WorldInfo;                                                // 0x00BC(0x0004) (Const, Transient)
	float                                              LifeSpan;                                                 // 0x00C0(0x0004)
	float                                              CreationTime;                                             // 0x00C4(0x0004) (Const)
	float                                              LastRenderTime;                                           // 0x00C8(0x0004) (Transient)
	struct FName                                       Tag;                                                      // 0x00CC(0x0008) (Edit)
	struct FName                                       UniqueTag;                                                // 0x00D4(0x0008) (Edit)
	struct FName                                       InitialState;                                             // 0x00DC(0x0008)
	struct FName                                       Group;                                                    // 0x00E4(0x0008) (Edit)
	TArray<class AActor*>                              Touching;                                                 // 0x00EC(0x000C) (Const, Transient, NeedCtorLink)
	TArray<class AActor*>                              Children;                                                 // 0x00F8(0x000C) (Const, Transient, NeedCtorLink)
	float                                              LatentFloat;                                              // 0x0104(0x0004) (Const)
	class UAnimNodeSequence*                           LatentSeqNode;                                            // 0x0108(0x0004) (Const)
	class APhysicsVolume*                              PhysicsVolume;                                            // 0x010C(0x0004) (Const, Transient)
	struct FVector                                     Location;                                                 // 0x0110(0x000C) (Edit, Const, Net)
	struct FRotator                                    Rotation;                                                 // 0x011C(0x000C) (Edit, Const, Net)
	struct FVector                                     Velocity;                                                 // 0x0128(0x000C) (Net)
	struct FVector                                     Acceleration;                                             // 0x0134(0x000C)
	class USkeletalMeshComponent*                      BaseSkelComponent;                                        // 0x0140(0x0004) (Edit, ExportObject, Component, EditInline)
	struct FName                                       BaseBoneName;                                             // 0x0144(0x0008) (Edit)
	TArray<class AActor*>                              Attached;                                                 // 0x014C(0x000C) (Const, NeedCtorLink)
	struct FVector                                     RelativeLocation;                                         // 0x0158(0x000C) (Const, Net)
	struct FRotator                                    RelativeRotation;                                         // 0x0164(0x000C) (Const, Net)
	float                                              DrawScale;                                                // 0x0170(0x0004) (Edit, Const, Net)
	struct FVector                                     DrawScale3D;                                              // 0x0174(0x000C) (Edit, Const)
	struct FVector                                     PrePivot;                                                 // 0x0180(0x000C) (Edit, Const)
	class UPrimitiveComponent*                         CollisionComponent;                                       // 0x018C(0x0004) (Edit, ExportObject, Component, EditInline)
	int                                                OverlapTag;                                               // 0x0190(0x0004) (Native)
	TEnumAsByte<ECollisionType>                        CollisionType;                                            // 0x0194(0x0001) (Edit, Const, Transient)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0195(0x0003) MISSED OFFSET
	struct FRotator                                    RotationRate;                                             // 0x0198(0x000C) (Edit)
	struct FRotator                                    DesiredRotation;                                          // 0x01A4(0x000C) (Edit)
	class AActor*                                      PendingTouch;                                             // 0x01B0(0x0004)
	float                                              m_fGravityScaling;                                        // 0x01B4(0x0004)
	float                                              DensityScaling;                                           // 0x01B8(0x0004) (Edit)
	class UEdLayer*                                    Layer;                                                    // 0x01BC(0x0004) (Edit, NoImport)
	class UClass*                                      MessageClass;                                             // 0x01C0(0x0004)
	TArray<class UClass*>                              SupportedEvents;                                          // 0x01C4(0x000C) (Const, NeedCtorLink)
	TArray<class USequenceEvent*>                      GeneratedEvents;                                          // 0x01D0(0x000C) (Const, NeedCtorLink)
	TArray<class USeqAct_Latent*>                      LatentActions;                                            // 0x01DC(0x000C) (NeedCtorLink)
	int                                                m_nActorTickBreakGroup;                                   // 0x01E8(0x0004)
	float                                              m_fCombatStasisTime;                                      // 0x01EC(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.Actor");
		return ptr;
	}


	class UClass* STATIC_GetSaveObjectClass();
	void PostInitAnimTree(class USkeletalMeshComponent* SkelComp);
	void RootMotionExtracted(class USkeletalMeshComponent* SkelComp, struct FBoneAtom* ExtractedRootMotionDelta);
	void RootMotionModeChanged(class USkeletalMeshComponent* SkelComp);
	void PostRenderFor(class APlayerController* PC, class UCanvas* Canvas, const struct FVector& CameraPosition, const struct FVector& CameraDir);
	void NativePostRenderFor(class APlayerController* PC, class UCanvas* Canvas, const struct FVector& CameraPosition, const struct FVector& CameraDir);
	void SetHUDLocation(const struct FVector& NewHUDLocation);
	void RigidBodyCollision(class UPrimitiveComponent* HitComponent, class UPrimitiveComponent* OtherComponent, int ContactIndex, struct FCollisionImpactData* RigidCollisionData);
	class UDecalComponent* AddDecal(class UMaterialInterface* DecalMaterial, const struct FVector& DecalLocation, const struct FRotator& DecalOrientation, float DecalRotation, float Width, float Height, float Thickness, bool bNoClip, class UPrimitiveComponent* HitComponent, class UDecalLifetimeData* LifetimeData, bool bProjectOnTerrain, bool bProjectOnSkeletalMeshes, const struct FName& HitBone, int HitNodeIndex, int HitLevelIndex, float DepthBias, float Backface);
	void InterpolationChanged(class USeqAct_Interp* InterpAction);
	void InterpolationFinished(class USeqAct_Interp* InterpAction);
	void InterpolationStarted(class USeqAct_Interp* InterpAction);
	void PickedUpBy(class APawn* P);
	void SpawnedByKismet();
	struct FVector GetTargetLocation(class AActor* RequestedBy);
	void FindGoodEndView(class APlayerController* PC, struct FRotator* GoodRotation);
	void NotifyLocalPlayerTeamReceived();
	struct FString GetLocationStringFor(class APlayerReplicationInfo* PRI);
	unsigned char ScriptGetTeamNum();
	unsigned char GetTeamNum();
	void PawnBaseDied();
	bool IsPlayerOwned();
	void GetActorEyesViewPoint(struct FVector* out_Location, struct FRotator* out_Rotation);
	bool IsStationary();
	class UFaceFXAsset* GetActorFaceFXAsset();
	bool IsActorPlayingFaceFXAnim();
	void SetSkelControlScale(const struct FName& SkelControlName, float Scale);
	void SetMorphWeight(const struct FName& MorphNodeName, float MorphWeight);
	void StopActorFaceFXAnim();
	bool PlayActorFaceFXAnim(class UFaceFXAnimSet* AnimSet, const struct FString& GroupName, const struct FString& SeqName);
	void FinishAnimControl();
	void SetAnimWeights(TArray<struct FAnimSlotInfo> SlotInfos);
	void SetAnimPosition(const struct FName& SlotName, int ChannelIndex, const struct FName& InAnimSeqName, float InPosition, bool bFireNotifies, bool bLooping);
	void BeginAnimControl(TArray<class UAnimSet*> InAnimSets);
	void OnAnimPlay(class UAnimNodeSequence* SeqNode);
	void OnAnimEnd(class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime);
	void OnMakeNoise(class USeqAct_MakeNoise* Action);
	void DoKismetAttachment(class AActor* Attachment, class USeqAct_AttachToActor* Action);
	void OnAttachToActor(class USeqAct_AttachToActor* Action);
	void OnToggleHidden(class USeqAct_ToggleHidden* Action);
	void OnChangeCollision(class USeqAct_ChangeCollision* Action);
	void OnSetPhysics(class USeqAct_SetPhysics* Action);
	void OnSetBlockRigidBody(class USeqAct_SetBlockRigidBody* Action);
	void OnTeleportArrived();
	void OnTeleport(class USeqAct_Teleport* Action);
	void OnHealDamage(class USeqAct_HealDamage* Action);
	void OnCauseDamage(class USeqAct_CauseDamage* Action);
	void ShutDown();
	void ForceNetRelevant();
	void OnDestroy(class USeqAct_Destroy* Action);
	void ClearLatentAction(class UClass* actionClass, bool bAborted, class USeqAct_Latent* exceptionAction, bool bCancelled);
	bool FindEventsOfClass(class UClass* EventClass, TArray<class USequenceEvent*>* out_EventList);
	bool ActivateEventClass(class UClass* InClass, class AActor* InInstigator, bool bTest, TArray<class USequenceEvent*>* EventList, TArray<int>* ActivateIndices);
	bool TriggerEventClass(class UClass* InEventClass, class AActor* InInstigator, int ActivateIndex, bool bTest);
	float TimeSince(float Time);
	bool EffectIsRelevant(const struct FVector& SpawnLocation, bool bForceDedicated, float CullDistance);
	bool CheckMaxEffectDistance(class APlayerController* P, const struct FVector& SpawnLocation, float CullDistance);
	bool CanSplash();
	void PlayTeleportEffect(bool bOut, bool bSound);
	bool IsInPain();
	bool IsInVolume(class AVolume* aVolume);
	void Reset();
	class UAudioComponent* GetFaceFXAudioComponent();
	void ModifyHearSoundComponent(class UAudioComponent* AC);
	struct FString GetPhysicsName();
	void DisplayDebug(class AHUD* HUD, float* out_YL, float* out_YPos);
	struct FString GetDebugName();
	void SetGRI(class AGameReplicationInfo* GRI);
	void MatchStarting();
	struct FString STATIC_GetLocalString(int Switch, class APlayerReplicationInfo* RelatedPRI_2, class APlayerReplicationInfo* RelatedPRI_3);
	void STATIC_ReplaceText(const struct FString& Replace, const struct FString& With, struct FString* Text);
	struct FString GetHumanReadableName();
	struct FString GetItemName(const struct FString& FullName);
	bool CalcCamera(float fDeltaTime, struct FVector* out_CamLoc, struct FRotator* out_CamRot, float* out_FOV);
	void EndViewTarget(class APlayerController* PC);
	void BecomeViewTarget(class APlayerController* PC);
	bool CheckForErrors();
	void DebugFreezeGame();
	float GetGravityZ();
	void CheckHitInfo(class UPrimitiveComponent* FallBackComponent, const struct FVector& Dir, struct FTraceHitInfo* HitInfo, struct FVector* out_HitLocation);
	void TakeRadiusDamage(class AController* InstigatedBy, float BaseDamage, float DamageRadius, class UClass* DamageType, float Momentum, const struct FVector& HurtOrigin, bool bFullDamage, class AActor* DamageCauser, class UDamageType* pDamage);
	bool HealDamage(int Amount, class AController* Healer, class UClass* DamageType);
	void TakeDamage(float DamageAmount, class AController* EventInstigator, const struct FVector& HitLocation, const struct FVector& Momentum, class UClass* DamageType, const struct FTraceHitInfo& HitInfo, class AActor* DamageCauser, class UDamageType* pDamage);
	void KilledBy(class APawn* EventInstigator);
	bool HurtRadius(float BaseDamage, float DamageRadius, class UClass* DamageType, float Momentum, const struct FVector& HurtOrigin, class AActor* IgnoredActor, class AController* InstigatedByController, bool bDoFullDamage, class UDamageType* pDamage);
	bool StopsProjectile(class AProjectile* P);
	void NotifySkelControlBeyondLimit(class USkelControlLookAt* LookAt);
	void ConstraintBrokenNotify(class AActor* ConOwner, class URB_ConstraintSetup* ConSetup, class URB_ConstraintInstance* ConInstance);
	void SetInitialState();
	void PostBeginPlay();
	void BioBeginPlay();
	void BroadcastLocalizedTeamMessage(int TeamIndex, class UClass* InMessageClass, int Switch, class APlayerReplicationInfo* RelatedPRI_2, class APlayerReplicationInfo* RelatedPRI_3, class UObject* OptionalObject);
	void BroadcastLocalizedMessage(class UClass* InMessageClass, int Switch, class APlayerReplicationInfo* RelatedPRI_2, class APlayerReplicationInfo* RelatedPRI_3, class UObject* OptionalObject);
	void PreBeginPlay();
	bool FindActorsOfClass(class UClass* ActorClass, TArray<class AActor*>* out_Actors);
	void LocalPlayerControllers(class UClass* BaseClass, class APlayerController** PC);
	void AllOwnedComponents(class UClass* BaseClass, class UActorComponent** OutComponent);
	void ComponentList(class UClass* BaseClass, class UActorComponent** out_Component);
	void OverlappingActors(class UClass* BaseClass, float Radius, const struct FVector& Loc, bool bIgnoreHidden, class AActor** out_Actor);
	void CollidingActors(class UClass* BaseClass, float Radius, const struct FVector& Loc, bool bUseOverlapCheck, class AActor** Actor);
	void VisibleCollidingActors(class UClass* BaseClass, float Radius, const struct FVector& Loc, bool bIgnoreHidden, class AActor** Actor);
	void VisibleActors(class UClass* BaseClass, float Radius, const struct FVector& Loc, class AActor** Actor);
	void TraceActors(class UClass* BaseClass, const struct FVector& End, const struct FVector& Start, const struct FVector& Extent, class AActor** Actor, struct FVector* HitLoc, struct FVector* HitNorm, struct FTraceHitInfo* HitInfo);
	void TouchingActors(class UClass* BaseClass, class AActor** Actor);
	void BasedActors(class UClass* BaseClass, class AActor** Actor);
	void ChildActors(class UClass* BaseClass, class AActor** Actor);
	void DynamicActors(class UClass* BaseClass, class AActor** Actor);
	void AllActors(class UClass* BaseClass, class AActor** Actor);
	struct FString GetURLMap();
	void PostTeleport(class ATeleporter* OutTeleporter);
	bool PreTeleport(class ATeleporter* InTeleporter);
	struct FVector GetDestination(class AController* C);
	bool SuggestTossVelocity(const struct FVector& Destination, const struct FVector& Start, float TossSpeed, float BaseTossZ, float DesiredZPct, const struct FVector& CollisionSize, float TerminalVelocity, struct FVector* TossVelocity);
	bool PlayerCanSeeMe();
	void MakeNoiseAt(float Loudness, const struct FVector& vLoc, const struct FName& NoiseType, bool bDampenNoise);
	void MakeNoise(float Loudness, const struct FName& NoiseType, bool bDampenNoise);
	void PlaySound(class USoundCue* InSoundCue, bool bNotReplicated, bool bNoRepToOwner, bool bStopWhenOwnerDestroyed, const struct FVector& SoundLocation, bool bNoRepToRelevant);
	class UAudioComponent* CreateAudioComponent(class USoundCue* InSoundCue, bool bPlay, bool bStopWhenOwnerDestroyed, bool bUseLocation, const struct FVector& SourceLocation, bool bAttachToSelf);
	float GetTimerRate(const struct FName& TimerFuncName, class UObject* inObj);
	float GetTimerCount(const struct FName& inTimerFunc, class UObject* inObj);
	bool IsTimerActive(const struct FName& inTimerFunc, class UObject* inObj);
	void ClearTimer(const struct FName& inTimerFunc, class UObject* inObj);
	void SetTimer(float InRate, bool inbLoop, const struct FName& inTimerFunc, class UObject* inObj);
	void TornOff();
	bool Destroy();
